Revit 2024 API
IATFTranslationServer.Translate Method
 Translate a model according to translationData settings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
bool Translate(
	ATFTranslationServiceData serviceData
)
Visual Basic
Function Translate ( _
	serviceData As ATFTranslationServiceData _
) As Boolean
Visual C++
bool Translate(
	ATFTranslationServiceData^ serviceData
)
Parameters
serviceData
Type: ATFTranslationServiceData
Return Value
 Returns true if the translation finished successfully, false otherwise.
See Also
IATFTranslationServer Interface
Autodesk.Revit.DB Namespace